const n = Number.parseFloat(prompt('Введіть стартове число')); //Отримайте у користувача число(N) від якого ми будемо складати. Отримати число можна за допомогою prompt. Пам'ятайте, ЧИСЛО, не РЯДОК!
const m = Number.parseFloat(prompt('Введіть фінальне чило')); //Отримайте у користувача число(M) до якого ми будемо складати (включно). Отримати число можна за допомогою prompt. Пам'ятайте, ЧИСЛО, не РЯДОК!


let isInt = true;
if (n % 1 != 0 || m % 1 != 0) { //Відбувається  перевірка чи числа є цілими і чи взагалі дані являються числами, порядком чи залишається остача при ділені на 1
    isInt = false;
}
if (isInt == true) {
    const answer = confirm('Бажаєте пропускати парні числа?'); //Отримайте у користувача булевий параметр(true/false), який підкаже нам чи потрібно пропускати парні числа. TRUE – потрібно, FALSE – не потрібно. Використовуйте функцію confirm
    let sum = 0
    if (answer == true) { // Дане розгалуденя перевіряє чи корислувач аідтвердив свій вибір н користь відкидання парних чисел
        for (let i = n; i <= m; i++) { //Напишіть цикл, який буде складати числа від раніше отриманих N и M
            if (i % 2 != 0) { //Тут іде перевірка чи число є непарни
                sum = sum + i; //і тоді числа додаються, якщо число парне пропуск до наступної ітерації
            }
        }
        document.write(`Cума не парних числ в діапазоні = ${sum}`);
    } else { //Якщо користувач відхилив пропозицію
        for (let i = n; i <= m; i++) {
            sum = i + sum; // то всі числа в діапазоні додаються
        }
        document.write(`Cума усіх числ в діапазоні = ${sum}`);
    }

} else { // Якщо чмло не пройшдло перевірку на цілісність або введені дані не є чилом, то користувач отримує наступне повідомлення
    alert("Погано");
}